Tekla Open API Reference for Tekla Structures 2025
SectionMarkSymbol Constructor
Overload List
Name | Description
SectionMarkBase.SectionMarkSymbol()
 Creates a new section mark symbol instance.
SectionMarkBase.SectionMarkSymbol(SectionMarkBase.SectionMarkSymbol.SymbolShapes, Double, Point)
 Creates a new section mark symbol instance with the given shape, size and position.
Top
See Also
Reference
SectionMarkBase.SectionMarkSymbol Class
Tekla.Structures.Drawing Namespace